:PROPERTIES:
:ID:       f40183ad-3931-4aa4-95ba-11ad09cd79ae
:END:
#+title: finding the mime type of a file

using the ~file~ command, we can see the [[id:0ff2391f-4a41-423f-a261-f6c97fe6dc4d][mime type]] of a file
#+begin_src sh :dir ~ :results output
  file --mime-type image.jpg
#+end_src

#+RESULTS:
: image.jpg: image/jpeg

- ~-b~ for (brief mode): don't prepend filenames to output lines
#+begin_src sh :dir ~ :results output
  file -b --mime-type image.jpg
#+end_src

#+RESULTS:
: image/jpeg
- ~-i~ to output mime type strings rather than the traditional human readable ones
#+begin_src sh :dir ~ :results output
  file -i image.jpg
#+end_src

#+RESULTS:
: image.jpg: image/jpeg; charset=binary
* Ref
- [[https://stackoverflow.com/a/2227201][linux - How can I find out a file's MIME type (Content-Type)? - Stack Overflow]]
